// 10118 이재석
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-1
//printf("C programming을 배웁시다.\n");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-2
//printf("%f를 반올림하면 %d입니다.\n", 34.5, 35);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-3
//printf("나의 이름은 %s입니다.\n", "홍길동");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-4
//printf("알파벳의 첫글자는 %c이고 끝글자는 %c입니다.\n", 'A', 'Z');
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-5
//printf("c 언어\nBASIC언어\n");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 1-6
//printf("C 언어\n\nBASIC 언어\n");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-1
//int a = 20, b = -5;
//printf("a + b = %d\n", a + b);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-2
//float ave = 10.25, sum = 4.32;
//printf("%.2f + %.2f = %.2f\n", ave, sum, ave + sum);
//printf("%.2f - %.2f = %.2f\n", ave, sum, ave - sum);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-3
//int no = 40000, count = 13000;
//printf("%d + %d = %d\n", no, count, no + count);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-4
//int no = 12;
//float ave = 324.1234;
//printf("%d + %.4f = %.4f\n", no, ave, no + ave);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-5
//char val = 'A';
//printf("%c의 ASCII값은 %d입니다.\n", val, val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-6
//char val = 71;
//printf("ASCII 값 %d의 영문자는 %c입니다.\n", val, val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 2-7
//printf("char\t:%dbyte,\tshort\t:%dbyte\n", sizeof(char), sizeof(short));
//printf("int\t:%dbyte,\tlong\t:%dbyte\n", sizeof(int), sizeof(long));
//printf("float\t:%dbyte,\tdouble\t:%dbyte\n", sizeof(float), sizeof(double));
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-1
//char val;
//scanf("%c", &val);
//printf("%c", val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-2
//char val;
//val = getchar();
//putchar(val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-3
//char val;
//val = getchar();
//printf("입력한 문자(%c)의 ASCII 값 : %d\n", val, val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-4
//int no, in, out;
//scanf("%d %d %d", &no, &in, &out);
//printf("%8d\n%06d\n%d\n", no, in, out);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-5
//float no, in, out;
//scanf("%f %f %f", &no, &in, &out);
//printf("%5.2f\n%-6.1f\n%06.0f\n", no, in, out);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-6
//int no, count;
//scanf("%d %d", &no, &count);
//printf("%d과 %d의 합은 %d입니다.\n", no, count, no+count);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-7
//unsigned int no;
//printf("양의 정수 : ");
//scanf("%d", &no);
//printf("8진수 : %o\n16진수 : %x\n", no, no);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-8
//float val;
//printf("실수 값을 입력하세요 : ");
//scanf("%f", &val);
//printf("결과 : %.2f 소수점 2자리까지", val/2);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-9
//int a[5], cnt1, cnt2;
//float avg;
//
//for (cnt1 = 0; cnt1 < 5; cnt1++) {
//scanf("%d", &a[cnt1]);
//}
//avg = (a[0] + a[1] + a[2] + a[3] + a[4]) / 5.0;
//for (cnt2 = 0; cnt2 < 5; cnt2++) {
//printf("%10d\n", a[cnt2]);
//}
//printf("-----------\n");
//printf("%10.1f\n", avg);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-10
//int ftem, ctem;
//float avg;
//printf("화씨 온도를 입력하세요 > ");
//scanf("%d", &ftem);
//ctem = (ftem - 32) * 5 / 9;
//printf("섭씨 온도는 %d도입니다.\n", ctem);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 3-11
//float val;
//scanf("%f", &val);
//printf("%.3f %.2f %.1f\n", val, val, val);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-1
//int a, b;
//scanf("%d %d", &a, &b);
//printf("a + b = %d\na - b = %d\n", (a+b), (a-b));
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-2
//int n = 100;
//printf("%d\n", ++n); // 101
//printf("%d\n", n++); // 101
//printf("%d\n", n+1); // 103
//printf("%d\n", n); // 102
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-3
//int a, b;
//printf("두수를 입력하세요 : ");
//scanf("%d %d", &a, &b);
//printf("몫 : %d\n", a/b);
//printf("나머지 : %d\n", a%b);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-4
//int a, b;
//printf("두수를 입력하세요 : ");
//scanf("%d %d", &a, &b);
//printf("결과 : %.2f\t소수점 2자리까지 구할것\n", (float)a/b);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-5
//int a, b, big;
//printf("두수를 입력하세요 : ");
//scanf("%d %d", &a, &b);
//big = (a > b) ? a : b;
//printf("큰수 : %d\n", big);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-6
//int no, ans;
//scanf("%d", &no);
//printf("%d", no & 0b1111);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-7
//int no, count;
//printf("값을 입력하세요 : ");
//scanf("%d", &no);
//printf("shift하고자 하는 값 : ");
//scanf("%d", &count);
//printf("결과 : %d\n", no << count);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 4-8
//int no, count;
//printf("값을 입력하세요 : ");
//scanf("%d", &no);
//printf("shift하고자 하는 값 : ");
//scanf("%d", &count);
//printf("결과 : %d\n", no >> count);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-1
// (1) if ((number > 1) || (number < 10))
// (2) if ((ch != 'q') && (ch != 'z')
// (3) if ((no >= 1) && (no <= 10) && (no != 5))
// (4) if (!(no >= 1) && (no <= 10))
// (5) if ((ch == ' ') && (ch == '\n'
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-2
//		int score;
//	char grade;
//	scanf("%d", &score);
//	if (score >= 90)
//		grade = 'A';
//	else if (score >= 80) // if문을 사용하면 70보다 크거나 같은 값은 무조건 c가 나오고
//		grade = 'b';	  // 70보다 작은 값은 f가 나오므로 if가 아니라 else if를 사용해야 한다.
//	else if (score >= 70)
//		grade = 'c';
//	else
//		grade = 'f';
//	printf("%c\n", grade);
//	return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-3
//int no;
//scanf("%d", &no); // &가 없다.
//if ((no >= 1) && (no <= 10)) // 조건문은 한 번에 두 개만 비교할 수 있다. 논리연산자 사용
//printf("%d\n", no * 2); // printf 함수 첫 번쨰 인자 큰따옴표 사용
//else // if문이 틀렸을 때 실행해야 하므로 else 사용
//printf("%d\n", no);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-4
//	int score = 85;
//	char grade;
//	switch (score / 10) { // 중괄호열기는 switch문 시작에
//	case 10:
//	case 9: grade = 'A'; break; // A 출력 후 탈출을 위해 break 사용
//	case 8: grade = 'B'; break; // B 출력 후 탈출을 위해 break 사용
//	case 7: grade = 'C'; break; // C 출력 후 탈출을 위해 break 사용
//	case 6: grade = 'D'; break; // D 출력 후 탈출을 위해 break 사용
//	default: grade = 'F'; // 문장 끝에 세미콜론 사용
//	} // 중괄호닫기는 switch문 종료에
//	printf("%c\n", grade); // grade 출력은 switch문 바깥에
//	return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-5
//int a = 12, b = -34;
//if (a > 0)
//printf("%d는 양의 값입니다.\n", a);
//else if (a == 0)
//printf("%d는 0입니다.\n", a);
//else
//printf("%d는 음의 값입니다.\n", a);
//if (b > 0)
//printf("%d는 양의 값입니다.\n", b);
//else if (b == 0)
//printf("%d는 0입니다.\n", b);
//else
//printf("%d는 음의 값입니다.\n", b);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-6
//char a;
//scanf("%c", &a);
//if ((a >= 'A') && (a <= 'Z'))
//printf("대문자 %c입니다.\n", a);
//else
//printf("소문자 %c입니다.\n", a);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-7
//int a;
//scanf("%d", &a);
//if (a <= 12)
//printf("오전%d시\n", a);
//else if(a>12)
//printf("오후%d시\n", a-12);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-8
//char a;
//printf("영문자를 입력하세요 : ");
//scanf("%c", &a);
//if ((a >= 'a') && (a <= 'z'))
//printf("결과 : %c\n", a - 32);
//else
//printf("결과 : %c\n", a);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-9
//int a, b;
//printf("두수를 입력하세요 : ");
//scanf("%d %d", &a, &b);
//if (a < 0)
//a *= -1;
//if (b < 0)
//b *= -1;
//printf("절대 값의 합 : %d\n", a + b);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-10
//int a;
//printf("정수를 입력하세요 : ");
//scanf("%d", &a);
//if (a%2 == 0)
//printf("%d는 짝수입니다.\n", a);
//if (a%2 == 1)
//printf("%d는 홀수입니다.\n", a);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-11
//char a, b, c;
//printf("영문자를 입력하세요 : ");
//scanf("%c%c%c", &a, &b, &c);
//if (a < b) {
//if (a < c)
//printf("결과 : %c\n", a);
//}
//else if (b < c)
//printf("결과 : %c\n", b);
//else
//printf("결과 : %c\n", c);
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-12
//int a;
//printf("등급을 입력하세요 : ");
//scanf("%d", &a);
//if (a <= 2)
//printf("아주 잘했어요\n");
//else if (a <= 4)
//printf("잘했어요\n");
//else if (a <= 6)
//printf("노력해야 겠어요\n");
//else
//printf("아주 많이 노력해야 겠어요\n");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-13
//int a;
//printf("점수를 입력하세요 : ");
//scanf("%d", &a);
//if (a >= 90)
//printf("A\n");
//else if (a >= 80)
//printf("B\n");
//else if (a >= 70)
//printf("C\n");
//else if (a >= 60)
//printf("D\n");
//else
//printf("F\n");
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-14
//int a;
//printf("등급을 입력하세요 : ");
//scanf("%d", &a);
//switch (a) {
//case 1: printf("아주 잘했어요\n"); break;
//case 2:
//case 3: printf("잘했어요\n"); break;
//case 4:
//case 5: printf("노력해야 겠어요\n"); break;
//case 6:
//case 7: printf("아주 많이 노력해야 겠어요\n"); break;
//}
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-15
//char a;
//printf("영문자를 입력하세요 : ");
//scanf("%c", &a);
//switch (a) {
//case 'b':
//case 'B': printf("BASIC\n"); break;
//case 'c':
//case 'C': printf("CABOL\n"); break;
//case 'f':
//case 'F': printf("FORTRAN\n"); break;
//case 'l':
//case 'L': printf("LISP\n"); break;
//case 'p':
//case 'P': printf("Pascal\n"); break;
//}
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-16
//int a;
//printf("등수를 입력하세요 : ");
//scanf("%d", &a);
//switch (a) {
//case 1:
//case 2:
//case 3:
//case 4: printf("상패");
//if (a == 4) {
//printf("\n"); break;
//}
//printf(", 상금");
//if (a == 3) {
//printf("\n"); break;
//}
//printf(", 컴퓨터");
//if (a == 2) {
//printf("\n"); break;
//}
//printf(", 프린터\n");
//}
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-17
//int a;
//printf("점수를 입력하세요 : ");
//scanf("%d", &a);
//switch (a/10) {
//case 10:
//case 9: printf("A\n"); break;
//case 8: printf("B\n"); break;
//case 7: printf("C\n"); break;
//case 6: printf("D\n"); break;
//default: printf("F\n"); break;
//}
//return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 5-18
//	char op;
//	int a, b;
//	printf("입력(연산기호 숫자 숫자) : ");
//	scanf("%c %d %d", &op, &a, &b);
//	if (op == '+')
//		printf("연산결과 : %d\n", a + b);
//	if (op == '-')
//		printf("연산결과 : %d\n", a - b);
//	if (op == '*')
//		printf("연산결과 : %d\n", a * b);
//	if (op == '/')
//		printf("연산결과 : %d ... %d\n", a / b, a % b);
//	return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 6-1
//	// while문
//	int a = 0;
//	while (a < 10) {
//		printf("%d\n", a);
//		a++;
//	}
//
//	// do~while문
//	int b = 0;
//	do {
//		printf("%d\n", b);
//		b++;
//	} while (b < 10);
//	
//	return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 6-2
//	int count = 0;
//	char ch;
//
//	ch = getchar();
//	while (ch != 'Q') {
//		++count;
//		putchar(ch);
//		ch = getchar();
//	}
//
//	return 0;
//}
////----------------------------------------------------------------------------------------
//#include <stdio.h>
//
//int main() {
//	// 6-3
//	int a = 10, n = 20, total = 0;
//
//	while (a < n) {
//		a++;
//		if (a != 0) {
//			total += a;
//			printf("%d %d\n", a, total);
//		}
//	}
//
//	while
//
//	return 0;
//}